<template>
    <div>
        <div>
            <van-nav-bar 
            title="登录"
            >
            <template #left>
                    <router-link to="/personal"><van-icon name="arrow-left"/></router-link>
                </template>
                <template #right>
                    <van-icon name="wap-nav" />
                </template>
            </van-nav-bar>
        </div>
        <div class="hualogo">
            <img src="../assets/wx_login_logo.png" alt="">
        </div>
        <van-form class="login">
		  <van-field
		    
		    type="text"
		    label="用户名"
		    placeholder="请输入手机号或邮箱"
		    :attr="{ maxlength: '20' }"
            v-model="username"
            :state="usernameState"
		  />
		  <van-field
		   
		    type="password"
		    label="密码"
		    placeholder="请输入密码"
		    :attr="{ maxlength: '20', autocomplete: 'off' }"
            v-model="password"
            :state="passwordState"
			>
			<template #right>
                    <van-icon name="closed-eye" />忘记密码
            </template>
		  </van-field>
			
		  <van-button round type="info" @click="handle">登录</van-button>
		  
		</van-form>
        <div class="register">
            <router-link to="/register">账户注册</router-link>
        </div>
        <van-divider>其他登录方式</van-divider>
        <div class="other">
            <a href="#">
                <svg t="1612853054784" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1124" width="24" height="24"><path d="M512 0C229.003636 0 0 229.003636 0 512s229.003636 512 512 512 512-229.003636 512-512S794.996364 0 512 0z m210.385455 641.396364c-7.447273 9.309091-26.996364-1.861818-41.89091-32.581819-3.723636 13.963636-13.032727 36.305455-34.443636 64.232728 35.374545 8.378182 44.683636 42.821818 33.512727 61.44-8.378182 13.032727-26.996364 24.203636-59.578181 24.203636-58.647273 0-83.781818-15.825455-95.883637-26.996364-1.861818-2.792727-5.585455-3.723636-10.24-3.723636-4.654545 0-7.447273 0.930909-10.24 3.723636-11.170909 11.170909-37.236364 26.996364-95.883636 26.996364-32.581818 0-52.130909-11.170909-59.578182-24.203636-12.101818-18.618182-1.861818-53.061818 33.512727-61.44-20.48-27.927273-29.789091-50.269091-34.443636-64.232728-13.963636 30.72-34.443636 42.821818-41.890909 32.581819-5.585455-8.378182-8.378182-26.065455-7.447273-38.167273 3.723636-46.545455 34.443636-85.643636 53.061818-106.123636-2.792727-5.585455-8.378182-40.029091 14.894546-63.301819v-1.861818c0-92.16 65.163636-158.254545 148.014545-158.254545 81.92 0 148.014545 66.094545 148.014546 158.254545v1.861818c23.272727 23.272727 17.687273 57.716364 14.894545 63.301819 17.687273 20.48 49.338182 59.578182 53.061818 106.123636 0.930909 12.101818-0.930909 29.789091-7.447272 38.167273z" fill="#30A5DD" p-id="1125"></path></svg>
                <span>QQ</span>
            </a>
            <a href="#">
                <svg t="1612853669342" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1942" width="24" height="24"><path d="M337.387283 341.82659c-17.757225 0-35.514451 11.83815-35.514451 29.595375s17.757225 29.595376 35.514451 29.595376 29.595376-11.83815 29.595376-29.595376c0-18.49711-11.83815-29.595376-29.595376-29.595375zM577.849711 513.479769c-11.83815 0-22.936416 12.578035-22.936416 23.6763 0 12.578035 11.83815 23.676301 22.936416 23.676301 17.757225 0 29.595376-11.83815 29.595376-23.676301s-11.83815-23.676301-29.595376-23.6763zM501.641618 401.017341c17.757225 0 29.595376-12.578035 29.595376-29.595376 0-17.757225-11.83815-29.595376-29.595376-29.595375s-35.514451 11.83815-35.51445 29.595375 17.757225 29.595376 35.51445 29.595376zM706.589595 513.479769c-11.83815 0-22.936416 12.578035-22.936416 23.6763 0 12.578035 11.83815 23.676301 22.936416 23.676301 17.757225 0 29.595376-11.83815 29.595376-23.676301s-11.83815-23.676301-29.595376-23.6763z" fill="#28C445" p-id="1943"></path><path d="M510.520231 2.959538C228.624277 2.959538 0 231.583815 0 513.479769s228.624277 510.520231 510.520231 510.520231 510.520231-228.624277 510.520231-510.520231-228.624277-510.520231-510.520231-510.520231zM413.595376 644.439306c-29.595376 0-53.271676-5.919075-81.387284-12.578034l-81.387283 41.433526 22.936416-71.768786c-58.450867-41.433526-93.965318-95.445087-93.965317-159.815029 0-113.202312 105.803468-201.988439 233.803468-201.98844 114.682081 0 216.046243 71.028902 236.023121 166.473989-7.398844-0.739884-14.797688-1.479769-22.196532-1.479769-110.982659 1.479769-198.289017 85.086705-198.289017 188.67052 0 17.017341 2.959538 33.294798 7.398844 49.572255-7.398844 0.739884-15.537572 1.479769-22.936416 1.479768z m346.265896 82.867052l17.757225 59.190752-63.630058-35.514451c-22.936416 5.919075-46.612717 11.83815-70.289017 11.83815-111.722543 0-199.768786-76.947977-199.768786-172.393063-0.739884-94.705202 87.306358-171.653179 198.289017-171.65318 105.803468 0 199.028902 77.687861 199.028902 172.393064 0 53.271676-34.774566 100.624277-81.387283 136.138728z" fill="#28C445" p-id="1944"></path></svg>
                <span>微信</span>
            </a>
            <a href="#">
                <svg t="1612853733624" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2709" width="24" height="24"><path d="M230.4 576.512c-12.288 9.728-25.088 24.064-28.672 41.984-5.12 24.576-1.024 55.296 22.528 79.872 28.672 29.184 72.704 37.376 91.648 38.912 51.2 3.584 105.984-22.016 147.456-50.688 16.384-11.264 44.032-34.304 70.144-69.632-59.392-30.72-133.632-64.512-212.48-61.44-40.448 1.536-69.632 9.728-90.624 20.992z m752.64 135.68c26.112-61.44 40.96-129.024 40.96-200.192C1024 229.888 794.112 0 512 0S0 229.888 0 512s229.888 512 512 512c170.496 0 321.536-83.968 414.72-211.968-88.064-43.52-232.96-115.712-322.56-159.232-42.496 48.64-105.472 97.28-176.64 118.272-44.544 13.312-84.992 18.432-126.976 9.728-41.984-8.704-72.704-28.16-90.624-47.616-9.216-10.24-19.456-22.528-27.136-37.888 0.512 1.024 1.024 2.048 1.024 3.072 0 0-4.608-7.68-7.68-19.456-1.536-6.144-3.072-11.776-3.584-17.92-0.512-4.096-0.512-8.704 0-12.8-0.512-7.68 0-15.872 1.536-24.064 4.096-20.48 12.8-44.032 35.328-65.536 49.152-48.128 114.688-50.688 148.992-50.176 50.176 0.512 138.24 22.528 211.968 48.64 20.48-43.52 33.792-90.112 41.984-121.344h-307.2v-33.28h157.696v-66.56H272.384V302.08h190.464V235.52c0-9.216 2.048-16.384 16.384-16.384h74.752V302.08h207.36v33.28h-207.36v66.56h165.888s-16.896 92.672-68.608 184.32c115.2 40.96 278.016 104.448 331.776 125.952z" fill="#06B4FD" p-id="2710"></path></svg>
                <span>支付宝</span>
            </a>
        </div>	
    </div>
    
</template>
<script>
export default {
    data(){
        return{
            //用户名的初始值
            username:"",
            //密码初始值
            password:"",
            //标识用户名的状态
            usernameState:"",
            //标识密码的状态
            passwordState:"",
        };
    },
    methods:{
        checkUsername(){
            //判断用户名是否合法
            let usernameRegExp=/^\w{6,20}$/;
            if(usernameRegExp.test(this.username)){
                this.usernameState="success";
                return true;
            }else{
                //短消息提示框
                this.$toast({
                    message:"用户名格式错误",
                    position:"middle",
                    duration:"5000"
                });
                this.usernameState="error";
                return false;
            }
        },
        checkPassword() {
        //判断密码是否合法
        let passwordRegExp = /^\w{8,20}$/;
            if (passwordRegExp.test(this.password)) {
                this.passwordState = "success";
                return true;
            } else {
                this.$toast({
                    message: "密码格式错误",
                    position: "middle",
                });
                this.passwordState = "error";
                return false;
            }
        },
        // 用户注册处理函数
        handle() {
        if (this.checkUsername() && this.checkPassword()) {
            //将用户名和密码信息提交到WEB服务器
            let object = {
            username: this.username,
            password: this.password,
            };
        this.axios.post("/login", this.qs.stringify(object)).then((res) => {
            if (res.data.code == 200) {
                //修改islogin
                //res.data.result存放的是当前登录成功的用户信息
                //把该用户信息存入vuex
                this.$store.commit('loginOk',res.data.results);
                //把用户信息存入sessionStorage
                let userString = JSON.stringify(res.data.results);
                window.sessionStorage.setItem("user", userString);
                // 登录成功
                this.$router.push("/");
                }
                if (res.data.code == 201) {
                // 登录失败
                this.$toast("用户名或密码错误",);
                
                }
            });
          }
        },
    }
}
</script>
<style scoped>
.van-nav-bar .van-icon {
    color: #232628;
    font-size: 0.4rem;    
}
.hualogo{
    text-align: center;
    margin-top: 1rem;
}
.hualogo>img{
    width: 5rem;
    height: 0.7rem; 
}
.login{
    padding: 0.4rem;
     margin-top:0.5rem;
}
.van-field + .van-field{
    margin-top: 0.5rem;
}

.login .van-button{
    margin-top: 0.7rem;
    margin-bottom: 0.5rem;
    background: #ff734c;
    border: 0.07142857rem solid #ff734c;
    font-size: 0.4rem;
    width: 100%;
}
.register{
    margin-bottom: 1.5rem;
    font-size: 0.35rem;
    text-align: center
}
.register>a{
    color: #71797f;
}
.other{
    display: flex;
    justify-content: space-around;
    padding: 0 0.5rem;
    position: relative;
    margin-right: 0.6rem;
}
.other>a{
    font-size: 0.25rem;
}
.other>a>span{
    position:absolute;
    top: 0.09rem; 
    color: #000;
}
.other>a>svg+span{
    margin-left: 0.2rem;
}
</style>